; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 2654)
	(= (fuel plane1) 224)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at plane2 city1)
	(= (capacity plane2) 8506)
	(= (fuel plane2) 3573)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 4)
	(at person1 city4)
	(at person2 city1)
	(at person3 city1)
	(at person4 city1)
	(at person5 city3)
	(at person6 city3)
	(at person7 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 650)
	(= (distance city0 city2) 892)
	(= (distance city0 city3) 580)
	(= (distance city0 city4) 604)
	(= (distance city1 city0) 650)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 669)
	(= (distance city1 city3) 854)
	(= (distance city1 city4) 588)
	(= (distance city2 city0) 892)
	(= (distance city2 city1) 669)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 519)
	(= (distance city2 city4) 532)
	(= (distance city3 city0) 580)
	(= (distance city3 city1) 854)
	(= (distance city3 city2) 519)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 662)
	(= (distance city4 city0) 604)
	(= (distance city4 city1) 588)
	(= (distance city4 city2) 532)
	(= (distance city4 city3) 662)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city2)
	(at plane2 city0)
	(at person1 city2)
	(at person2 city1)
	(at person3 city1)
	(at person4 city4)
	(at person6 city3)
	(at person7 city3)
	))

(:metric minimize (+ (* 2 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (fly plane2 city1 city0)
   deleted: (at plane2 city1)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 0 to 2600, (fuel plane2) from 3573 to 973
   goals met: 4 of 8
2. (refuel plane1 city4)
   changed: (fuel plane1) from 224 to 2654
   goals met: 4 of 8
3. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 8
4. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 2600 to 3132, (fuel plane1) from 2654 to 2122
   goals met: 5 of 8
5. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 8
6. (fly plane1 city2 city4)
   deleted: (at plane1 city2)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 3132 to 3664, (fuel plane1) from 2122 to 1590
   goals met: 5 of 8
7. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 3664 to 4252, (fuel plane1) from 1590 to 1002
   goals met: 5 of 8
8. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 5 of 8
9. (board person7 plane1 city1)
   deleted: (at person7 city1)
   added: (in person7 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 8
10. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 4252 to 4921, (fuel plane1) from 1002 to 333
   goals met: 6 of 8
11. (refuel plane1 city2)
   changed: (fuel plane1) from 333 to 2654
   goals met: 6 of 8
12. (fly plane1 city2 city4)
   deleted: (at plane1 city2)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 4921 to 5453, (fuel plane1) from 2654 to 2122
   goals met: 5 of 8
13. (debark person4 plane1 city4)
   deleted: (in person4 plane1)
   added: (at person4 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 8
14. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 5453 to 6115, (fuel plane1) from 2122 to 1460
   goals met: 6 of 8
15. (debark person7 plane1 city3)
   deleted: (in person7 plane1)
   added: (at person7 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 8
16. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 6115 to 6634, (fuel plane1) from 1460 to 941
   goals met: 8 of 8
